УТ/src/InformationRegisters/CRM_ПапкиУчетныхЗаписей/CRM_ПапкиУчетныхЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ПапкиУчетныхЗаписей</name>
  <resources>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПапки</name>
    <type>
      <types>EnumRef.CRM_ВидыПапокЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Catalogs/ПапкиЭлектронныхПисем/ПапкиЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПапкиЭлектронныхПисем</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.УчетныеЗаписиЭлектроннойПочты</owners>
  <attributes>
    <name>ПредопределеннаяПапка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <comment>CRM</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредопределеннойПапки</name>
    <type>
      <types>EnumRef.ТипыПредопределенныхПапокПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Вид</name>
    <type>
      <types>EnumRef.CRM_ВидыПапокЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПапкаMSExchange</name>
    <type>
      <types>CatalogRef.CRM_СтруктурыПапокMSExchange</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Подписаться</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/InformationRegisters/CRM_ПапкиУчетныхЗаписей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись.
//
// Параметры:
//  УчетнаяЗапись	 - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты	 - Учетная запись.
//  ВидПапки		 - ПеречислениеСсылка.CRM_ВидыПапокЭлектроннойПочты	 - Вид папки.
//  Папка			 - СправочникСсылка.ПапкиЭлектронныхПисем			 - Папка.
//
Процедура УстановитьПапку(УчетнаяЗапись, ВидПапки, Папка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрана учетная запись'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидПапки) Тогда
		ВызватьИсключение НСтр("ru = 'Не выбран вид папки'");
	КонецЕсли;
	
	Запись = РегистрыСведений.CRM_ПапкиУчетныхЗаписей.СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.ВидПапки = ВидПапки;
	Запись.Прочитать();
	
	Если Запись.Выбран() И Не ЗначениеЗаполнено(Папка) Тогда
		Запись.Удалить();
		Возврат;
	КонецЕсли;
	
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.ВидПапки = ВидПапки;
	Запись.Папка = Папка;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Возвращает папку необходимого вида для учетной записи. Если не удалось найти, возвращает Неопределено.
//
// Параметры:
//  УчетнаяЗапись	 - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты	 - Учетная запись.
//  ВидПапки		 - ПеречислениеСсылка.CRM_ВидыПапокЭлектроннойПочты	 - Вид папки.
// 
// Возвращаемое значение:
//   - СправочникСсылка.ПапкиЭлектронныхПисем, Неопределено
//
Функция ПолучитьПапку(УчетнаяЗапись, ВидПапки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрана учетная запись'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидПапки) Тогда
		ВызватьИсключение НСтр("ru = 'Не выбран вид папки'");
	КонецЕсли;
	
	Запись = РегистрыСведений.CRM_ПапкиУчетныхЗаписей.СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.ВидПапки = ВидПапки;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Запись.Папка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПапкиУчетныхЗаписей.УчетнаяЗапись КАК УчетнаяЗапись
	|ПОМЕСТИТЬ НастроенныеУчетныеЗаписи
	|ИЗ
	|	РегистрСведений.CRM_ПапкиУчетныхЗаписей КАК ПапкиУчетныхЗаписей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПапкиЭлектронныхПисем.Ссылка КАК Папка,
	|	ПапкиЭлектронныхПисем.Владелец КАК УчетнаяЗапись,
	|	ПапкиЭлектронныхПисем.CRM_Вид КАК ВидПапки,
	|	ПапкиЭлектронныхПисем.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПапкиЭлектронныхПисем КАК ПапкиЭлектронныхПисем
	|ГДЕ
	|	ПапкиЭлектронныхПисем.ПредопределеннаяПапка
	|	И НЕ ПапкиЭлектронныхПисем.Владелец В
	|				(ВЫБРАТЬ
	|					НастроенныеУчетныеЗаписи.УчетнаяЗапись КАК УчетнаяЗапись
	|				ИЗ
	|					НастроенныеУчетныеЗаписи)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УчетнаяЗапись");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИменаПредопределенныхПапок = CRM_УправлениеЭлектроннойПочтой.ИменаПредопределенныхПапок();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидПапки = Выборка.ВидПапки;
		Если Не ЗначениеЗаполнено(ВидПапки) Тогда
			ВидПапки = CRM_УправлениеЭлектроннойПочтой.ВидПапкиПоНаименованию(Выборка.Наименование, ИменаПредопределенныхПапок);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВидПапки) Тогда
			Продолжить;
		КонецЕсли;
		МенеджерЗаписи = РегистрыСведений.CRM_ПапкиУчетныхЗаписей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УчетнаяЗапись	= Выборка.УчетнаяЗапись;
		МенеджерЗаписи.ВидПапки			= ВидПапки;
		МенеджерЗаписи.Папка			= Выборка.Папка;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
